app/views/tracks/sandbox.html.erb


$(document).ready(function(){

	changeImage();

	navigator.geolocation.getCurrentPosition(function(pos) { load(pos) }, function(error) {load()});
	function load(pos){
		var geo_lat = -41.306802;
		var geo_lng = 174.776874;
		if (pos) {
			geo_lat = (pos.coords.latitude = null) ? -41 : pos.coords.latitude;
			geo_lng = (pos.coords.longitude = null) ? 174 : pos.coords.longitude;
		}

		var coords = [
		<% @track.coordinates.map do |c| %>
			[<%= c.longitude.to_s %>, <%= c.latitude.to_s  %>],
		<% end %>]

		var midpoint_lat = (coords[0][0] + geo_lat) / 2;
		var midpoint_lng = (coords[0][1] + geo_lng) / 2;

---
SELECT "coordinates".* FROM "coordinates" WHERE "coordinates"."track_id" = $1  [["track_id", 1025]]