app/views/tracks/show.html.erb


	var coords = [
	<% @track.coordinates.map do |c| %>
		[<%= c.longitude.to_s %>, <%= c.latitude.to_s  %>],
	<% end %>]
---
SELECT "coordinates".* FROM "coordinates" WHERE "coordinates"."track_id" = $1  [["track_id", 895]]