app/controllers/tracks_controller.rb

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT 1  [["id", 895]]
SELECT "button_texts".* FROM "button_texts"
---
  def show
    @track = Track.find(params[:id])
    @button = ButtonText.all().sample

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT 1  [["id", 1025]]
SELECT "button_texts".* FROM "button_texts"
---
  def sandbox
    @track = Track.find(params[:id])
    @button = ButtonText.all().sample